# WaterTintEnable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Water..::..WaterTintEnable Property
Water Class See Also
---
The property labeled "Color" from the "Water" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaterTintEnable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaterTintEnable As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaterTintEnable {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterTintEnableType".
# See Also
Water Class
Autodesk.Revit.DB.Visual Namespace